on_pic = "https://telegra.ph/file/5593d624d11d92bceb48e.jpg"
off_pic = "https://telegra.ph/file/0d9e590f62b63b51d4bf9.jpg"
files_cmd_pic = "https://telegra.ph/file/d44f46054250a73053614.jpg"
autodel_cmd_pic = "https://telegra.ph/file/a64533814021b40057ccd.jpg"

#start message
START_MSG = """<b>✨ ʜᴇʏ ᴛʜᴇʀᴇ, {first}
        
๏ ᴅɪᴠᴇ ɪɴᴛᴏ ʏᴏᴜʀ ꜰᴀᴠᴏʀɪᴛᴇ ᴀɴɪᴍᴇ ᴡᴏʀʟᴅ ɴᴏᴡ!

‣ ᴜᴘᴅᴀᴛᴇs: <a href='https://t.me/OceanXBotz'>ᴏᴄᴇᴀɴxʙᴏᴛᴢ</a>
‣ ꜱᴜᴘᴘᴏʀᴛ: <a href='https://t.me/Anime_Ocean_Official'>ᴀɴɪᴍᴇs ᴏᴄᴇᴀɴ</a></b>"""

#Force sub message 
FORCE_MSG = """<b>♡ ʜᴇʏ, {mention}

‼️🔐 ʏᴏᴜ ᴍᴜsᴛ ᴊᴏɪɴ ᴀʟʟ ᴍʏ ᴄʜᴀɴɴᴇʟs ᴛᴏ ᴜɴʟᴏᴄᴋ ʏᴏᴜʀ ᴀɴɪᴍᴇ ꜰɪʟᴇs...

<blockquote>๏ ᴀꜰᴛᴇʀ ᴊᴏɪɴɪɴɢ ᴀʟʟ ᴛʜᴇ ᴄʜᴀɴɴᴇʟs ʟɪsᴛᴇᴅ ʙᴇʟᴏᴡ, ᴛᴀᴘ ᴏɴ "↻ ᴛʀʏ ᴀɢᴀɪɴ" ⬇️</blockquote></b>"""

CMD_TXT = """<b>🤖 𝗕𝗔𝗦𝗜𝗖 𝗔𝗗𝗠𝗜𝗡 𝗖𝗢𝗠𝗠𝗔𝗡𝗗𝗦 :

<b>/batch :</b> ᴄʀᴇᴀᴛᴇ ʙᴀᴛᴄʜ ᴍᴇssᴀɢᴇs

<b>/genlink :</b> ɢᴇɴᴇʀᴀᴛᴇ ʟɪɴᴋ ꜰᴏʀ ᴀ ꜱɪɴɢʟᴇ ᴘᴏsᴛ

<b>/broadcast :</b> sᴇɴᴅ ᴀ ʙʀᴏᴀᴅᴄᴀsᴛ ᴍᴇssᴀɢᴇ

<code>/broadcast silent</code> : sᴇɴᴅ ᴀ sɪʟᴇɴᴛ ʙʀᴏᴀᴅᴄᴀsᴛ

<b>/status :</b> ᴄʜᴇᴄᴋ ʙᴏᴛ ꜱᴛᴀᴛɪꜱᴛɪᴄꜱ"""

BAN_TXT = "<b><blockquote>ᴀᴄᴄᴇꜱꜱ ᴅᴇɴɪᴇᴅ • ʏᴏᴜ ᴀʀᴇ ʙᴀɴɴᴇᴅ 🚫</blockquote></b>"

HELP_TEXT = """<b>⁉️ ʜᴇʟʟᴏ {mention} ~

<blockquote expandable>➪ ɪ ᴀᴍ ᴀ ᴘʀɪᴠᴀᴛᴇ ꜰɪʟᴇ-ꜱʜᴀʀɪɴɢ ʙᴏᴛ ᴅᴇꜱɪɢɴᴇᴅ ᴛᴏ ᴘʀᴏᴠɪᴅᴇ ᴀɴɪᴍᴇ ꜰɪʟᴇꜱ ᴀɴᴅ ʀᴇʟᴀᴛᴇᴅ ᴄᴏɴᴛᴇɴᴛ ᴠɪᴀ ꜱᴘᴇᴄɪᴀʟ ʟɪɴᴋꜱ ꜰᴏʀ ꜱᴘᴇᴄɪꜰɪᴄ ᴄʜᴀɴɴᴇʟꜱ.

➪ ᴛᴏ ᴀᴄᴄᴇꜱꜱ ꜰɪʟᴇꜱ, ʏᴏᴜ ᴍᴜꜱᴛ ᴊᴏɪɴ ᴀʟʟ ᴛʜᴇ ᴍᴇɴᴛɪᴏɴᴇᴅ ᴄʜᴀɴɴᴇʟꜱ. ᴜɴᴛɪʟ ᴛʜᴇɴ, ꜰɪʟᴇꜱ ᴡɪʟʟ ʀᴇᴍᴀɪɴ ʟᴏᴄᴋᴇᴅ.

➪ ꜱᴏ ɢᴏ ᴀʜᴇᴀᴅ ᴀɴᴅ ᴊᴏɪɴ ᴛʜᴇ ʀᴇǫᴜɪʀᴇᴅ ᴄʜᴀɴɴᴇʟꜱ ᴛᴏ ꜱᴛᴀʀᴛ ɢᴇᴛᴛɪɴɢ ʏᴏᴜʀ ᴀɴɪᴍᴇ ꜰɪʟᴇꜱ ᴏʀ ᴛʀɪɢɢᴇʀ ᴍᴇꜱꜱᴀɢᴇꜱ...

‣ /help -</b> ᴏᴘᴇɴ ᴛʜɪꜱ ʜᴇʟᴘ ᴍᴇꜱꜱᴀɢᴇ !</blockquote>
<b><i>◈ ꜱᴛɪʟʟ ɴᴇᴇᴅ ᴀꜱꜱɪꜱᴛᴀɴᴄᴇ? ᴄᴏɴᴛᴀᴄᴛ ᴛʜᴇ ᴘᴇʀꜱᴏɴ/ɢʀᴏᴜᴘ ʙᴇʟᴏᴡ ᴀꜱ ɴᴇᴇᴅᴇᴅ !</i></b>"""

ABOUT_TXT = """<b>• ʜᴏꜱᴛᴇᴅ ʙʏ: @OceanXBotz</b>"""

SETTING_TXT = """<b>⚙️ ᴄᴏɴꜰɪɢᴜʀᴀᴛɪᴏɴꜱ</b>
<blockquote expandable>◈ ᴛᴏᴛᴀʟ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟꜱ:  <b>{total_fsub}</b>
◈ ᴛᴏᴛᴀʟ ᴀᴅᴍɪɴꜱ:  <b>{total_admin}</b>
◈ ᴛᴏᴛᴀʟ ʙᴀɴɴᴇᴅ ᴜꜱᴇʀꜱ:  <b>{total_ban}</b>
◈ ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ᴍᴏᴅᴇ:  <b>{autodel_mode}</b>
◈ ᴘʀᴏᴛᴇᴄᴛ ᴄᴏɴᴛᴇɴᴛ:  <b>{protect_content}</b>
◈ ʜɪᴅᴇ ᴄᴀᴘᴛɪᴏɴ:  <b>{hide_caption}</b>
◈ ᴄʜᴀɴɴᴇʟ ʙᴜᴛᴛᴏɴ:  <b>{chnl_butn}</b>
◈ ʀᴇǫᴜᴇꜱᴛ ꜰꜱᴜʙ ᴍᴏᴅᴇ: <b>{reqfsub}</b></blockquote>"""

on_txt, off_txt = "ᴇɴᴀʙʟᴇᴅ ✅", "ᴅɪꜱᴀʙʟᴇᴅ ❌"

FILES_CMD_TXT ="""<b>🤖 ꜰɪʟᴇ-ʀᴇʟᴀᴛᴇᴅ ꜱᴇᴛᴛɪɴɢꜱ ⚙️

<blockquote expandable>🔒 ᴘʀᴏᴛᴇᴄᴛ ᴄᴏɴᴛᴇɴᴛ: {protect_content}
🫥 ʜɪᴅᴇ ᴄᴀᴘᴛɪᴏɴ: {hide_caption}
🔘 ᴄʜᴀɴɴᴇʟ ʙᴜᴛᴛᴏɴ: {channel_button}</b>

◈ ʙᴜᴛᴛᴏɴ ɴᴀᴍᴇ: {name}
◈ ʙᴜᴛᴛᴏɴ ʟɪɴᴋ: {link}</blockquote>

<b>ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴꜱ ʙᴇʟᴏᴡ ᴛᴏ ᴛᴡᴇᴀᴋ ᴛʜᴇꜱᴇ ꜱᴇᴛᴛɪɴɢꜱ</b>"""

AUTODEL_CMD_TXT = """<b>🤖 ᴀᴜᴛᴏ-ᴅᴇʟᴇᴛᴇ ꜱᴇᴛᴛɪɴɢꜱ ⚙️

<blockquote>🗑️ ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ᴍᴏᴅᴇ: {autodel_mode}</blockquote>
<blockquote>⏱ ᴅᴇʟᴇᴛᴇ ᴛɪᴍᴇʀ: {timer}</blockquote>

ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴꜱ ʙᴇʟᴏᴡ ᴛᴏ ᴜᴘᴅᴀᴛᴇ ᴛʜᴇꜱᴇ ꜱᴇᴛᴛɪɴɢꜱ</b>"""

FSUB_CMD_TXT = """<b>🤖 ꜰᴏʀᴄᴇ ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴ ᴄᴏᴍᴍᴀɴᴅꜱ :</b>

<b>/fsub_chnl</b> : ʟɪꜱᴛ ᴄᴜʀʀᴇɴᴛ ꜰᴏʀᴄᴇ-ꜱᴜʙ ᴄʜᴀɴɴᴇʟꜱ (ᴀᴅᴍɪɴꜱ)

<b>/add_fsub</b> : ᴀᴅᴅ ᴏɴᴇ ᴏʀ ᴍᴏʀᴇ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟꜱ (ᴏᴡɴᴇʀ)

<b>/del_fsub</b> : ʀᴇᴍᴏᴠᴇ ᴏɴᴇ ᴏʀ ᴍᴏʀᴇ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟꜱ (ᴏᴡɴᴇʀ)"""


USER_CMD_TXT = """<b>🤖 ᴜꜱᴇʀ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ ᴄᴏᴍᴍᴀɴᴅꜱ :</b>
    
<b>/admin_list</b> : ꜱʜᴏᴡ ᴛʜᴇ ᴀᴅᴍɪɴ ʟɪꜱᴛ (ᴏᴡɴᴇʀ)

<b>/add_admins</b> : ᴀᴅᴅ ᴏɴᴇ ᴏʀ ᴍᴏʀᴇ ᴜꜱᴇʀ ɪᴅꜱ ᴀꜱ ᴀᴅᴍɪɴꜱ (ᴏᴡɴᴇʀ)

<b>/del_admins</b> : ʀᴇᴍᴏᴠᴇ ᴏɴᴇ ᴏʀ ᴍᴏʀᴇ ᴜꜱᴇʀ ɪᴅꜱ ꜰʀᴏᴍ ᴀᴅᴍɪɴꜱ (ᴏᴡɴᴇʀ)

<b>/banuser_list</b> : ᴠɪᴇᴡ ᴛʜᴇ ʙᴀɴɴᴇᴅ ᴜꜱᴇʀꜱ ʟɪꜱᴛ (ᴀᴅᴍɪɴꜱ)

<b>/add_banuser</b> : ᴀᴅᴅ ᴏɴᴇ ᴏʀ ᴍᴏʀᴇ ᴜꜱᴇʀ ɪᴅꜱ ᴛᴏ ᴛʜᴇ ʙᴀɴɴᴇᴅ ʟɪꜱᴛ (ᴀᴅᴍɪɴꜱ)

<b>/del_banuser</b> : ʀᴇᴍᴏᴠᴇ ᴏɴᴇ ᴏʀ ᴍᴏʀᴇ ᴜꜱᴇʀ ɪᴅꜱ ꜰʀᴏᴍ ᴛʜᴇ ʙᴀɴɴᴇᴅ ʟɪꜱᴛ (ᴀᴅᴍɪɴꜱ)"""



RFSUB_CMD_TXT = """<b>🤖 ʀᴇǫᴜᴇꜱᴛ ꜰꜱᴜʙ ꜱᴇᴛᴛɪɴɢꜱ 🚦

<blockquote><b>📢 ʀᴇǫᴜᴇꜱᴛ ꜰꜱᴜʙ ᴍᴏᴅᴇ: {req_mode}</b></blockquote>

ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴꜱ ʙᴇʟᴏᴡ ᴛᴏ ᴛᴏɢɢʟᴇ ᴛʜᴇꜱᴇ ꜱᴇᴛᴛɪɴɢꜱ</b>"""


RFSUB_MS_TXT = """<b>🤖 ʀᴇǫᴜᴇꜱᴛ ꜰꜱᴜʙ ʟɪꜱᴛ 🚥

<blockquote expandable>{reqfsub_list}</blockquote>
ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴꜱ ʙᴇʟᴏᴡ ᴛᴏ ᴍᴀɴᴀɢᴇ ᴛʜᴇꜱᴇ ꜱᴇᴛᴛɪɴɢꜱ</b>"""

CLEAR_USERS_TXT = """<blockquote expandable><b>ᴡʜᴀᴛ ᴅᴏᴇꜱ "ᴄʟᴇᴀʀ ᴜꜱᴇʀꜱ" ᴅᴏ !?</b>

➪ ᴄʟᴇᴀʀ ᴜꜱᴇʀꜱ ʀᴇᴍᴏᴠᴇꜱ ᴀʟʟ ᴜꜱᴇʀ ᴅᴀᴛᴀ ꜰʀᴏᴍ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ʀᴇǫᴜᴇꜱᴛ ꜰᴏʀᴄᴇ-ꜱᴜʙ ᴄʜᴀɴɴᴇʟ ɪᴅ. 

➪ ᴛʜɪꜱ ᴏɴʟʏ ᴅᴇʟᴇᴛᴇꜱ ᴜꜱᴇʀ ᴅᴀᴛᴀ — ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪᴛꜱᴇʟꜰ ʀᴇᴍᴀɪɴꜱ ɪɴᴛᴀᴄᴛ.</blockquote>

<b><i>ᴘɪᴄᴋ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪᴅ ᴛᴏ ᴄʟᴇᴀʀ ᴜꜱᴇʀ ᴅᴀᴛᴀ ꜰʀᴏᴍ:</i></b>"""


CLEAR_CHNLS_TXT = """<blockquote expandable><b>ᴡʜᴀᴛ ᴅᴏᴇꜱ "ᴄʟᴇᴀʀ ᴄʜᴀɴɴᴇʟꜱ" ᴅᴏ !?</b>

➪ ᴄʟᴇᴀʀ ᴄʜᴀɴɴᴇʟꜱ ᴅᴇʟᴇᴛᴇꜱ ᴀʟʟ ᴜꜱᴇʀ ᴅᴀᴛᴀ ᴀɴᴅ ʀᴇᴍᴏᴠᴇꜱ ᴛʜᴇ ʀᴇǫᴜᴇꜱᴛ ꜰᴏʀᴄᴇ-ꜱᴜʙ ᴄʜᴀɴɴᴇʟ ɪᴅ ꜰʀᴏᴍ ᴛʜᴇ ᴅᴀᴛᴀʙᴀꜱᴇ. 

➪ ɪꜰ ᴜꜱᴇʀ ᴅᴀᴛᴀ ᴇxɪꜱᴛꜱ, ɪᴛ ɢᴇᴛꜱ ᴡɪᴘᴇᴅ, ᴀɴᴅ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪᴅ ɪꜱ ᴀʟꜱᴏ ᴘᴇʀᴍᴀɴᴇɴᴛʟʏ ʀᴇᴍᴏᴠᴇᴅ.</blockquote>

<b><i>ꜱᴇʟᴇᴄᴛ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪᴅ ᴛᴏ ʀᴇᴍᴏᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇʟʏ:</i></b>"""


CLEAR_LINKS_TXT = """<blockquote expandable><b>ᴡʜᴀᴛ ᴅᴏᴇꜱ "ᴄʟᴇᴀʀ ʟɪɴᴋꜱ" ᴅᴏ !?</b>

➪ ᴄʟᴇᴀʀ ʟɪɴᴋꜱ ᴅᴇʟᴇᴛᴇꜱ ꜱᴛᴏʀᴇᴅ ʀᴇǫᴜᴇꜱᴛ ʟɪɴᴋꜱ ꜰᴏʀ ᴀ ꜱᴘᴇᴄɪꜰɪᴇᴅ ᴄʜᴀɴɴᴇʟ ꜰʀᴏᴍ ᴛʜᴇ ᴅᴀᴛᴀʙᴀꜱᴇ ᴀɴᴅ ʀᴇᴠᴏᴋᴇꜱ ᴛʜᴇᴍ ꜰʀᴏᴍ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ. 

➪ ᴇᴠᴇɴ ɪꜰ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ᴅᴀᴛᴀ ɪꜱ ᴄʟᴇᴀʀᴇᴅ, ᴛʜᴇ ʀᴇǫᴜᴇꜱᴛ ʟɪɴᴋꜱ ᴍɪɢʜᴛ ꜱᴛɪʟʟ ʙᴇ ꜱᴛᴏʀᴇᴅ ꜰᴏʀ ꜰᴜᴛᴜʀᴇ ᴜꜱᴇ. 

➪ ʙʏ ᴄʟᴇᴀʀɪɴɢ ᴛʜᴇ ʟɪɴᴋꜱ, ᴛʜᴇʏ ʙᴇᴄᴏᴍᴇ ɪɴᴠᴀʟɪᴅ ᴀɴᴅ ᴄᴀɴ ɴᴏ ʟᴏɴɢᴇʀ ʙᴇ ᴜꜱᴇᴅ. 

➪ ɪꜰ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ɪꜱ ᴀᴅᴅᴇᴅ ᴀɢᴀɪɴ ᴀꜱ ᴀ ʀᴇǫᴜᴇꜱᴛ ꜰᴏʀᴄᴇ-ꜱᴜʙ ᴄʜᴀɴɴᴇʟ ʟᴀᴛᴇʀ, ᴛʜᴇ ʙᴏᴛ ᴡɪʟʟ ɢᴇɴᴇʀᴀᴛᴇ ᴀ ɴᴇᴡ ʟɪɴᴋ.

<b>⚠️ ɴᴏᴛᴇ:</b> 
‣ ꜰᴏʀ ᴛʜɪꜱ ᴛᴏ ᴡᴏʀᴋ, ᴛʜᴇ ʙᴏᴛ ᴍᴜꜱᴛ ʙᴇ ᴀɴ ᴀᴅᴍɪɴ ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜ ᴛʜᴇ ɴᴇᴄᴇꜱꜱᴀʀʏ ᴘᴇʀᴍɪꜱꜱɪᴏɴꜱ. 

‣ ɪꜰ ᴛʜᴇ ʙᴏᴛ ɪꜱ ɴᴏᴛ ɪɴ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ᴏʀ ʟᴀᴄᴋꜱ ᴀᴅᴍɪɴ ʀɪɢʜᴛꜱ, ᴛʜɪꜱ ᴀᴄᴛɪᴏɴ ᴄᴀɴɴᴏᴛ ʙᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ.</blockquote>

<b><i>ᴄʜᴏᴏꜱᴇ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪᴅ ᴛᴏ ʀᴇᴠᴏᴋᴇ ɪᴛꜱ ʀᴇǫᴜᴇꜱᴛ ʟɪɴᴋ:</i></b>"""